Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAME70J20.xml
          <instance name="AFEC1">
            <register-group address-space="base" name="AFEC1" name-in-module="AFEC" offset="0x40064000"/>
            <signals>
              <signal pad="PD9" function="C" group="AFE1_ADTRG"/>
              <signal pad="PB1" function="X1" group="AFE1_AD" index="0"/>
              <signal pad="PB1" function="X1" group="RTCOUT" index="1"/>
              <signal pad="PC13" function="X1" group="AFE1_AD" index="1"/>
              <signal pad="PC15" function="X1" group="AFE1_AD" index="2"/>
              <signal pad="PC12" function="X1" group="AFE1_AD" index="3"/>
              <signal pad="PC29" function="X1" group="AFE1_AD" index="4"/>
              <signal pad="PC30" function="X1" group="AFE1_AD" index="5"/>
              <signal pad="PC31" function="X1" group="AFE1_AD" index="6"/>
              <signal pad="PC26" function="X1" group="AFE1_AD" index="7"/>
              <signal pad="PC27" function="X1" group="AFE1_AD" index="8"/>
              <signal pad="PC0" function="X1" group="AFE1_AD" index="9"/>
              <signal pad="PE3" function="X1" group="AFE1_AD" index="10"/>
              <signal pad="PE0" function="X1" group="AFE1_AD" index="11"/>
            </signals>
          </instance>
        </module>
        <module name="CHIPID" version="6417ZB">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x400E0940"/>
          </instance>
        </module>
        <module name="EFC" version="6450V">
          <instance name="EFC">
            <register-group address-space="base" name="EFC" name-in-module="EFC" offset="0x400E0C00"/>
            <parameters>
              <param name="FLASH_SIZE" value="1048576"/>
              <param name="PAGE_SIZE" value="512"/>
              <param name="PAGES_PR_REGION" value="16"/>
            </parameters>
          </instance>
        </module>
        <module name="GMAC" version="11046L">
          <instance name="GMAC">
            <register-group address-space="base" name="GMAC" name-in-module="GMAC" offset="0x40050000"/>
            <signals>
              <signal pad="PD13" function="A" group="GCOL"/>
              <signal pad="PD10" function="A" group="GCRS"/>
              <signal pad="PD8" function="A" group="GMDC"/>
              <signal pad="PD9" function="A" group="GMDIO"/>
              <signal pad="PD14" function="A" group="GRXCK"/>
              <signal pad="PD4" function="A" group="GRXDV"/>
              <signal pad="PD7" function="A" group="GRXER"/>
              <signal pad="PD5" function="A" group="GRX" index="0"/>
              <signal pad="PD6" function="A" group="GRX" index="1"/>
              <signal pad="PD11" function="A" group="GRX" index="2"/>
              <signal pad="PD12" function="A" group="GRX" index="3"/>
              <signal pad="PB1" function="B" group="GTSUCOMP"/>
              <signal pad="PB12" function="B" group="GTSUCOMP"/>
              <signal pad="PD11" function="C" group="GTSUCOMP"/>
              <signal pad="PD20" function="C" group="GTSUCOMP"/>
              <signal pad="PD0" function="A" group="GTXCK"/>
              <signal pad="PD1" function="A" group="GTXEN"/>
              <signal pad="PD17" function="A" group="GTXER"/>
              <signal pad="PD2" function="A" group="GTX" index="0"/>
              <signal pad="PD3" function="A" group="GTX" index="1"/>
              <signal pad="PD15" function="A" group="GTX" index="2"/>
              <signal pad="PD16" function="A" group="GTX" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="GPBR" version="6378G">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1890"/>
          </instance>
        </module>
        <module name="HSMCI" version="6449P">
          <instance name="HSMCI">
            <register-group address-space="base" name="HSMCI" name-in-module="HSMCI" offset="0x40000000"/>
            <signals>
              <signal pad="PA28" function="C" group="MCCDA"/>
              <signal pad="PA25" function="D" group="MCCK"/>
              <signal pad="PA30" function="C" group="MCDA" index="0"/>
              <signal pad="PA31" function="C" group="MCDA" index="1"/>
              <signal pad="PA26" function="C" group="MCDA" index="2"/>
              <signal pad="PA27" function="C" group="MCDA" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="ICM" version="11105D">
          <instance name="ICM">
            <register-group address-space="base" name="ICM" name-in-module="ICM" offset="0x40048000"/>
          </instance>
        </module>
        <module name="ISI" version="6350I">
          <instance name="ISI">
            <register-group address-space="base" name="ISI" name-in-module="ISI" offset="0x4004C000"/>
            <signals>
              <signal pad="PD22" function="D" group="ISI_D" index="0"/>
              <signal pad="PD21" function="D" group="ISI_D" index="1"/>
              <signal pad="PB3" function="D" group="ISI_D" index="2"/>
              <signal pad="PA9" function="B" group="ISI_D" index="3"/>
              <signal pad="PA5" function="B" group="ISI_D" index="4"/>
              <signal pad="PD11" function="D" group="ISI_D" index="5"/>
              <signal pad="PD12" function="D" group="ISI_D" index="6"/>
              <signal pad="PA27" function="D" group="ISI_D" index="7"/>
              <signal pad="PD27" function="D" group="ISI_D" index="8"/>
              <signal pad="PD28" function="D" group="ISI_D" index="9"/>
              <signal pad="PD30" function="D" group="ISI_D" index="10"/>
              <signal pad="PD31" function="D" group="ISI_D" index="11"/>
              <signal pad="PD24" function="D" group="ISI_HSYNC"/>
              <signal pad="PA24" function="D" group="ISI_PCK"/>
              <signal pad="PD25" function="D" group="ISI_VSYNC"/>
            </signals>
          </instance>
        </module>
